# Дано списки:
#
# numbers_1 = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
# numbers_2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
# Потрібно створити функцію, яка буде принімати два списки і вертати список, в якому будуть тільки ті елементи, які є в обох списках.
def same(l1, l2):
    result = []
    for element in l1:
        if element in l2:
            result.append(element)
            return result


numbers_1 = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
numbers_2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
same(numbers_1, numbers_2)
